app/controllers/answers_controller.rb

  def index
    @answers = Answer.all
---
SELECT "answers".* FROM "answers"

  def show
    @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]